In [2]:
import pandas as pd
import numpy as np


dates = pd.date_range("20250101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2025-01-01  0.925322 -0.318563  0.344672  1.181691
2025-01-02  2.130020 -0.506347  0.107688  0.809622
2025-01-03 -0.534115  1.079316  0.815243  0.964938
2025-01-04  0.698912  1.492294  0.735679 -0.705812
2025-01-05 -1.047641 -0.132206  0.382479 -0.256860
2025-01-06 -0.264538  1.087544 -0.896395 -2.051475

In [3]:
df1 = df.reindex(index=dates[0: 4], columns=list(df.columns) + ['E'])
df1.iloc[0:2,4] = 1
df1

                   A         B         C         D    E
2025-01-01  0.925322 -0.318563  0.344672  1.181691  1.0
2025-01-02  2.130020 -0.506347  0.107688  0.809622  1.0
2025-01-03 -0.534115  1.079316  0.815243  0.964938  NaN
2025-01-04  0.698912  1.492294  0.735679 -0.705812  NaN

In [4]:
df1.dropna()

                   A         B         C         D    E
2025-01-01  0.925322 -0.318563  0.344672  1.181691  1.0
2025-01-02  2.130020 -0.506347  0.107688  0.809622  1.0

In [5]:
df1.fillna(5)

                   A         B         C         D    E
2025-01-01  0.925322 -0.318563  0.344672  1.181691  1.0
2025-01-02  2.130020 -0.506347  0.107688  0.809622  1.0
2025-01-03 -0.534115  1.079316  0.815243  0.964938  5.0
2025-01-04  0.698912  1.492294  0.735679 -0.705812  5.0

In [6]:
s = pd.Series([1, 3, 1, np.nan, 6, 8], index=dates).shift(2)
s

2025-01-01    NaN
2025-01-02    NaN
2025-01-03    1.0
2025-01-04    3.0
2025-01-05    1.0
2025-01-06    NaN
Freq: D, dtype: float64

In [7]:
df

                   A         B         C         D
2025-01-01  0.925322 -0.318563  0.344672  1.181691
2025-01-02  2.130020 -0.506347  0.107688  0.809622
2025-01-03 -0.534115  1.079316  0.815243  0.964938
2025-01-04  0.698912  1.492294  0.735679 -0.705812
2025-01-05 -1.047641 -0.132206  0.382479 -0.256860
2025-01-06 -0.264538  1.087544 -0.896395 -2.051475

In [8]:
df.sub(s, axis="index")

                   A         B         C         D
2025-01-01       NaN       NaN       NaN       NaN
2025-01-02       NaN       NaN       NaN       NaN
2025-01-03 -1.534115  0.079316 -0.184757 -0.035062
2025-01-04 -2.301088 -1.507706 -2.264321 -3.705812
2025-01-05 -2.047641 -1.132206 -0.617521 -1.256860
2025-01-06       NaN       NaN       NaN       NaN

In [9]:
df

                   A         B         C         D
2025-01-01  0.925322 -0.318563  0.344672  1.181691
2025-01-02  2.130020 -0.506347  0.107688  0.809622
2025-01-03 -0.534115  1.079316  0.815243  0.964938
2025-01-04  0.698912  1.492294  0.735679 -0.705812
2025-01-05 -1.047641 -0.132206  0.382479 -0.256860
2025-01-06 -0.264538  1.087544 -0.896395 -2.051475

In [10]:
df.A.transform(lambda x: x*100)

2025-01-01     92.532204
2025-01-02    213.001975
2025-01-03    -53.411461
2025-01-04     69.891199
2025-01-05   -104.764128
2025-01-06    -26.453774
Freq: D, Name: A, dtype: float64

In [11]:
df.agg(lambda x: np.mean(x) * 100)

A    31.799336
B    45.033943
C    24.822748
D    -0.964941
dtype: float64

In [12]:
pd.concat([df, df]).value_counts()

A          B          C          D
-1.047641  -0.132206   0.382479  -0.256860    2
-0.534115   1.079316   0.815243   0.964938    2
-0.264538   1.087544  -0.896395  -2.051475    2
 0.698912   1.492294   0.735679  -0.705812    2
 0.925322  -0.318563   0.344672   1.181691    2
 2.130020  -0.506347   0.107688   0.809622    2
Name: count, dtype: int64

In [13]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [14]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [15]:
df1 = df.copy(deep=True)
df1.columns = df.columns.str.lower()
df1

                   a         b         c         d
2025-01-01  0.925322 -0.318563  0.344672  1.181691
2025-01-02  2.130020 -0.506347  0.107688  0.809622
2025-01-03 -0.534115  1.079316  0.815243  0.964938
2025-01-04  0.698912  1.492294  0.735679 -0.705812
2025-01-05 -1.047641 -0.132206  0.382479 -0.256860
2025-01-06 -0.264538  1.087544 -0.896395 -2.051475

In [16]:
df.join(df1)

,A,B,C,D,a,b,c,d
2025-01-01,0.925322,-0.318563,0.344672,1.181691,0.925322,-0.318563,0.344672,1.181691
2025-01-02,2.130020,-0.506347,0.107688,0.809622,2.130020,-0.506347,0.107688,0.809622
2025-01-03,-0.534115,1.079316,0.815243,0.964938,-0.534115,1.079316,0.815243,0.964938
2025-01-04,0.698912,1.492294,0.735679,-0.705812,0.698912,1.492294,0.735679,-0.705812
2025-01-05,-1.047641,-0.132206,0.382479,-0.256860,-1.047641,-0.132206,0.382479,-0.256860
2025-01-06,-0.264538,1.087544,-0.896395,-2.051475,-0.264538,1.087544,-0.896395,-2.051475

In [17]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

left.merge(right, on='key', how='inner')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [18]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],"k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [25]:
data[~data.k1.duplicated()]

    k1  k2
0  one   1
1  two   1

In [28]:
data.drop_duplicates('k1', keep='last')

    k1  k2
4  one   3
6  two   4

In [ ]:
class Solution:
    def maxSubArray(self, nums: list[int]) -> int:
        res = float('-inf')
        curr = 0
        for n in nums:
            curr = max(0, curr+n)
            curr += n
            res = max(curr, res)
        
        return res

[[7, 4, 1], [8, 5, 2], [9, 6, 3]]